[command]/home/runner/work/_temp/755ae58b-581b-4241-aa18-f463f00589c7/terraform-bin plan -no-color
data.terraform_remote_state.backend: Reading...
data.terraform_remote_state.backend: Read complete after 1s
module.ecr.data.aws_caller_identity.current: Reading...
module.ecr.data.aws_caller_identity.current: Read complete after 0s [id=976193222510]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.asg.aws_appautoscaling_policy.frontend_tracking will be created
  + resource "aws_appautoscaling_policy" "frontend_tracking" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "frontend-tracking-policy"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/ECS-cluster/Frontend"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 300
          + target_value       = 50

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.asg.aws_appautoscaling_target.frontend_scale will be created
  + resource "aws_appautoscaling_target" "frontend_scale" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 2
      + min_capacity       = 1
      + resource_id        = "service/ECS-cluster/Frontend"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = (known after apply)
    }

  # module.ecr.aws_ecr_lifecycle_policy.frontend_policy will be created
  + resource "aws_ecr_lifecycle_policy" "frontend_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Delete untagged images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 1
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "frontend"
    }

  # module.ecr.aws_ecr_repository.frontend will be created
  + resource "aws_ecr_repository" "frontend" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "frontend"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.ecr.null_resource.push_frontend will be created
  + resource "null_resource" "push_frontend" {
      + id = (known after apply)
    }

  # module.ecs.aws_ecs_task_definition.frontend will be created
  + resource "aws_ecs_task_definition" "frontend" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = "arn:aws:iam::976193222510:role/AWSTaskExecutionRole"
      + family                   = "frontend-task"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.ecs.aws_iam_role.frontend_task_role will be created
  + resource "aws_iam_role" "frontend_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "FrontendTaskRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.ecs.aws_iam_role_policy.frontend_task_policy will be created
  + resource "aws_iam_role_policy" "frontend_task_policy" {
      + id          = (known after apply)
      + name        = "frontend-task-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::frontend-created-bucket-789/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.lb.aws_lb.app_lb will be created
  + resource "aws_lb" "app_lb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "Front-load-balancer"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-06a736a338aa35924",
          + "subnet-0cd73b534b94a24fc",
        ]
      + tags                                                         = {
          + "Name" = "app-lb"
        }
      + tags_all                                                     = {
          + "Name" = "app-lb"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # module.lb.aws_lb_listener.frontend_listener will be created
  + resource "aws_lb_listener" "frontend_listener" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.lb.aws_lb_target_group.frontend_tg will be created
  + resource "aws_lb_target_group" "frontend_tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "frontend-tg"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-08ebeabacac6165e3"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "80"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }
    }

  # module.s3.aws_s3_bucket.frontend will be created
  + resource "aws_s3_bucket" "frontend" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "frontend-created-bucket-789"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "frontend-created-bucket-789"
        }
      + tags_all                    = {
          + "Name" = "frontend-created-bucket-789"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3.aws_s3_bucket_policy.public_read will be created
  + resource "aws_s3_bucket_policy" "public_read" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.s3.aws_s3_bucket_public_access_block.frontend will be created
  + resource "aws_s3_bucket_public_access_block" "frontend" {
      + block_public_acls       = true
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = false
    }

  # module.service.aws_ecs_service.frontend will be created
  + resource "aws_ecs_service" "frontend" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "arn:aws:ecs:eu-central-1:976193222510:cluster/ECS-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "Frontend"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "Frontend-container"
          + container_port   = 80
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-06a736a338aa35924",
            ]
        }
    }

  # module.sg.aws_security_group.sg will be created
  + resource "aws_security_group" "sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "Frontend-Security"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Web Security Group"
        }
      + tags_all               = {
          + "Name" = "Web Security Group"
        }
      + vpc_id                 = "vpc-08ebeabacac6165e3"
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + frontend_ecr_url     = (known after apply)
  + frontend_service_url = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: data.terraform_remote_state.backend: Reading...%0Adata.terraform_remote_state.backend: Read complete after 1s%0Amodule.ecr.data.aws_caller_identity.current: Reading...%0Amodule.ecr.data.aws_caller_identity.current: Read complete after 0s [id=976193222510]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.asg.aws_appautoscaling_policy.frontend_tracking will be created%0A  + resource "aws_appautoscaling_policy" "frontend_tracking" {%0A      + alarm_arns         = (known after apply)%0A      + arn                = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "frontend-tracking-policy"%0A      + policy_type        = "TargetTrackingScaling"%0A      + resource_id        = "service/ECS-cluster/Frontend"%0A      + scalable_dimension = "ecs:service:DesiredCount"%0A      + service_namespace  = "ecs"%0A%0A      + target_tracking_scaling_policy_configuration {%0A          + disable_scale_in   = false%0A          + scale_in_cooldown  = 300%0A          + scale_out_cooldown = 300%0A          + target_value       = 50%0A%0A          + predefined_metric_specification {%0A              + predefined_metric_type = "ECSServiceAverageCPUUtilization"%0A            }%0A        }%0A    }%0A%0A  # module.asg.aws_appautoscaling_target.frontend_scale will be created%0A  + resource "aws_appautoscaling_target" "frontend_scale" {%0A      + arn                = (known after apply)%0A      + id                 = (known after apply)%0A      + max_capacity       = 2%0A      + min_capacity       = 1%0A      + resource_id        = "service/ECS-cluster/Frontend"%0A      + role_arn           = (known after apply)%0A      + scalable_dimension = "ecs:service:DesiredCount"%0A      + service_namespace  = "ecs"%0A      + tags_all           = (known after apply)%0A    }%0A%0A  # module.ecr.aws_ecr_lifecycle_policy.frontend_policy will be created%0A  + resource "aws_ecr_lifecycle_policy" "frontend_policy" {%0A      + id          = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + rules = [%0A                  + {%0A                      + action       = {%0A                          + type = "expire"%0A                        }%0A                      + description  = "Delete untagged images"%0A                      + rulePriority = 1%0A                      + selection    = {%0A                          + countNumber = 1%0A                          + countType   = "sinceImagePushed"%0A                          + countUnit   = "days"%0A                          + tagStatus   = "untagged"%0A                        }%0A                    },%0A                ]%0A            }%0A        )%0A      + registry_id = (known after apply)%0A      + repository  = "frontend"%0A    }%0A%0A  # module.ecr.aws_ecr_repository.frontend will be created%0A  + resource "aws_ecr_repository" "frontend" {%0A      + arn                  = (known after apply)%0A      + force_delete         = true%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "MUTABLE"%0A      + name                 = "frontend"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags_all             = (known after apply)%0A    }%0A%0A  # module.ecr.null_resource.push_frontend will be created%0A  + resource "null_resource" "push_frontend" {%0A      + id = (known after apply)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.frontend will be created%0A  + resource "aws_ecs_task_definition" "frontend" {%0A      + arn                      = (known after apply)%0A      + arn_without_revision     = (known after apply)%0A      + container_definitions    = (known after apply)%0A      + cpu                      = "256"%0A      + enable_fault_injection   = (known after apply)%0A      + execution_role_arn       = "arn:aws:iam::976193222510:role/AWSTaskExecutionRole"%0A      + family                   = "frontend-task"%0A      + id                       = (known after apply)%0A      + memory                   = "512"%0A      + network_mode             = "awsvpc"%0A      + requires_compatibilities = [%0A          + "FARGATE",%0A        ]%0A      + revision                 = (known after apply)%0A      + skip_destroy             = false%0A      + tags_all                 = (known after apply)%0A      + task_role_arn            = (known after apply)%0A      + track_latest             = false%0A    }%0A%0A  # module.ecs.aws_iam_role.frontend_task_role will be created%0A  + resource "aws_iam_role" "frontend_task_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ecs-tasks.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "FrontendTaskRole"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # module.ecs.aws_iam_role_policy.frontend_task_policy will be created%0A  + resource "aws_iam_role_policy" "frontend_task_policy" {%0A      + id          = (known after apply)%0A      + name        = "frontend-task-policy"%0A      + name_prefix = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "s3:GetObject",%0A                          + "s3:PutObject",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "arn:aws:s3:::frontend-created-bucket-789/*"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + role        = (known after apply)%0A    }%0A%0A  # module.lb.aws_lb.app_lb will be created%0A  + resource "aws_lb" "app_lb" {%0A      + arn                                                          = (known after apply)%0A      + arn_suffix                                                   = (known after apply)%0A      + client_keep_alive                                            = 3600%0A      + desync_mitigation_mode                                       = "defensive"%0A      + dns_name                                                     = (known after apply)%0A      + drop_invalid_header_fields                                   = false%0A      + enable_deletion_protection                                   = false%0A      + enable_http2                                                 = true%0A      + enable_tls_version_and_cipher_suite_headers                  = false%0A      + enable_waf_fail_open                                         = false%0A      + enable_xff_client_port                                       = false%0A      + enable_zonal_shift                                           = false%0A      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)%0A      + id                                                           = (known after apply)%0A      + idle_timeout                                                 = 60%0A      + internal                                                     = false%0A      + ip_address_type                                              = (known after apply)%0A      + load_balancer_type                                           = "application"%0A      + name                                                         = "Front-load-balancer"%0A      + name_prefix                                                  = (known after apply)%0A      + preserve_host_header                                         = false%0A      + security_groups                                              = (known after apply)%0A      + subnets                                                      = [%0A          + "subnet-06a736a338aa35924",%0A          + "subnet-0cd73b534b94a24fc",%0A        ]%0A      + tags                                                         = {%0A          + "Name" = "app-lb"%0A        }%0A      + tags_all                                                     = {%0A          + "Name" = "app-lb"%0A        }%0A      + vpc_id                                                       = (known after apply)%0A      + xff_header_processing_mode                                   = "append"%0A      + zone_id                                                      = (known after apply)%0A    }%0A%0A  # module.lb.aws_lb_listener.frontend_listener will be created%0A  + resource "aws_lb_listener" "frontend_listener" {%0A      + arn                                                                   = (known after apply)%0A      + id                                                                    = (known after apply)%0A      + load_balancer_arn                                                     = (known after apply)%0A      + port                                                                  = 80%0A      + protocol                                                              = "HTTP"%0A      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)%0A      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)%0A      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)%0A      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)%0A      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)%0A      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)%0A      + routing_http_response_access_control_max_age_header_value             = (known after apply)%0A      + routing_http_response_content_security_policy_header_value            = (known after apply)%0A      + routing_http_response_server_enabled                                  = (known after apply)%0A      + routing_http_response_strict_transport_security_header_value          = (known after apply)%0A      + routing_http_response_x_content_type_options_header_value             = (known after apply)%0A      + routing_http_response_x_frame_options_header_value                    = (known after apply)%0A      + ssl_policy                                                            = (known after apply)%0A      + tags_all                                                              = (known after apply)%0A      + tcp_idle_timeout_seconds                                              = (known after apply)%0A%0A      + default_action {%0A          + order            = (known after apply)%0A          + target_group_arn = (known after apply)%0A          + type             = "forward"%0A        }%0A    }%0A%0A  # module.lb.aws_lb_target_group.frontend_tg will be created%0A  + resource "aws_lb_target_group" "frontend_tg" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = (known after apply)%0A      + deregistration_delay               = "300"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancer_arns                 = (known after apply)%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + load_balancing_anomaly_mitigation  = (known after apply)%0A      + load_balancing_cross_zone_enabled  = (known after apply)%0A      + name                               = "frontend-tg"%0A      + name_prefix                        = (known after apply)%0A      + port                               = 80%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + slow_start                         = 0%0A      + tags_all                           = (known after apply)%0A      + target_type                        = "ip"%0A      + vpc_id                             = "vpc-08ebeabacac6165e3"%0A%0A      + health_check {%0A          + enabled             = true%0A          + healthy_threshold   = 2%0A          + interval            = 30%0A          + matcher             = "200"%0A          + path                = "/"%0A          + port                = "80"%0A          + protocol            = "HTTP"%0A          + timeout             = 5%0A          + unhealthy_threshold = 2%0A        }%0A    }%0A%0A  # module.s3.aws_s3_bucket.frontend will be created%0A  + resource "aws_s3_bucket" "frontend" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "frontend-created-bucket-789"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = true%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "Name" = "frontend-created-bucket-789"%0A        }%0A      + tags_all                    = {%0A          + "Name" = "frontend-created-bucket-789"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # module.s3.aws_s3_bucket_policy.public_read will be created%0A  + resource "aws_s3_bucket_policy" "public_read" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + policy = (known after apply)%0A    }%0A%0A  # module.s3.aws_s3_bucket_public_access_block.frontend will be created%0A  + resource "aws_s3_bucket_public_access_block" "frontend" {%0A      + block_public_acls       = true%0A      + block_public_policy     = false%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = true%0A      + restrict_public_buckets = false%0A    }%0A%0A  # module.service.aws_ecs_service.frontend will be created%0A  + resource "aws_ecs_service" "frontend" {%0A      + availability_zone_rebalancing      = "DISABLED"%0A      + cluster                            = "arn:aws:ecs:eu-central-1:976193222510:cluster/ECS-cluster"%0A      + deployment_maximum_percent         = 200%0A      + deployment_minimum_healthy_percent = 100%0A      + desired_count                      = 1%0A      + enable_ecs_managed_tags            = false%0A      + enable_execute_command             = false%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = "FARGATE"%0A      + name                               = "Frontend"%0A      + platform_version                   = (known after apply)%0A      + scheduling_strategy                = "REPLICA"%0A      + tags_all                           = (known after apply)%0A      + task_definition                    = (known after apply)%0A      + triggers                           = (known after apply)%0A      + wait_for_steady_state              = false%0A%0A      + load_balancer {%0A          + container_name   = "Frontend-container"%0A          + container_port   = 80%0A          + target_group_arn = (known after apply)%0A        }%0A%0A      + network_configuration {%0A          + assign_public_ip = true%0A          + security_groups  = (known after apply)%0A          + subnets          = [%0A              + "subnet-06a736a338aa35924",%0A            ]%0A        }%0A    }%0A%0A  # module.sg.aws_security_group.sg will be created%0A  + resource "aws_security_group" "sg" {%0A      + arn                    = (known after apply)%0A      + description            = "Managed by Terraform"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 443%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 443%0A            },%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 80%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 80%0A            },%0A        ]%0A      + name                   = "Frontend-Security"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name" = "Web Security Group"%0A        }%0A      + tags_all               = {%0A          + "Name" = "Web Security Group"%0A        }%0A      + vpc_id                 = "vpc-08ebeabacac6165e3"%0A    }%0A%0APlan: 16 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + frontend_ecr_url     = (known after apply)%0A  + frontend_service_url = (known after apply)%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0

<!-- Sticky Pull Request Comment -->